---
kind: method
id: M:Autodesk.Revit.DB.BarTypeDiameterOptions.#ctor(Autodesk.Revit.DB.Structure.RebarBarType)
source: html/58a4bebd-3b44-712b-1d33-8c55db8ec7de.htm
---
# Autodesk.Revit.DB.BarTypeDiameterOptions.#ctor Method

Constructs a new BarTypeDiameterOptions copying the diameter information from the bar type.

## Syntax (C#)
```csharp
public BarTypeDiameterOptions(
	RebarBarType barType
)
```

## Parameters
- **barType** (`Autodesk.Revit.DB.Structure.RebarBarType`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null